# CurveArray Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveArray Constructor
CurveArray Class See Also
---
Initializes a new instance of the CurveArray class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CurveArray()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
CurveArray()
```

# See Also
CurveArray Class
Autodesk.Revit.DB Namespace